package handling

var Years = map[string]int{"2020": 366, "2021": 365, "2022": 365, "2023": 365}

var leapMonth = map[string]int{"Январь": 31, "Февраль": 29, "Март": 31, "Апрель": 30, "Май": 31,
	"Июнь": 30, "Июль": 31, "Август": 31, "Сентябрь": 30, "Октябрь": 31,
	"Ноябрь": 30, "Декабрь": 31}

var commonMonth = map[string]int{"Январь": 31, "Февраль": 28, "Март": 31, "Апрель": 30, "Май": 31,
	"Июнь": 30, "Июль": 31, "Август": 31, "Сентябрь": 30, "Октябрь": 31,
	"Ноябрь": 30, "Декабрь": 31}

var mapMonthNum = map[string]int{"Январь": 1, "Февраль": 2, "Март": 3, "Апрель": 4, "Май": 5,
	"Июнь": 6, "Июль": 7, "Август": 8, "Сентябрь": 9, "Октябрь": 10,
	"Ноябрь": 11, "Декабрь": 12}
